---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNoPartTypeFound
source: html/031472a2-8fba-5fbe-f750-ce32c2e35514.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNoPartTypeFound Property

There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartNoPartTypeFound { get; }
```